# [Gruppierungen] Fortgeschrittene Beispiele mit GroupBy

In [2]:
import pandas as pd
umsatz = pd.read_csv("datengrundlage.xls")

## Datengrundlage filtern und gruppieren

In [4]:
umsatz.head(3)

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
0,1,1/1/2025,2025,Südkorea,Seoul,5534.55,4427.64,NaN,Bereich-5,prd-3,6-43647-1,C-85
1,2,1/2/2025,2025,Südkorea,Seoul,6284.70,7164.56,NaN,Bereich-5,prd-1,2-43647-1,C-107
2,3,1/3/2025,2025,Vereinigtes Königreich,London,5437.65,6198.92,NaN,Bereich-1,prd-56,7-43647-1,C-141

### Mexiko filtern

In [8]:
umsatz[umsatz.iloc[:, 3] == "Mexiko"]

In [9]:
mexiko.head()

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
27,28,1/28/2025,2025,Mexiko,Oaxaca,7071.60,7778.76,NaN,Bereich-2,prd-98,9-43647-1,C-117
36,37,2/6/2025,2025,Mexiko,Oaxaca,4595.25,2757.15,NaN,Bereich-2,prd-84,8-43647-1,C-109
38,39,2/8/2025,2025,Mexiko,Oaxaca,4276.35,2565.81,NaN,Bereich-1,prd-51,9-43648-1,C-117
45,46,2/15/2025,2025,Mexiko,Oaxaca,6861.60,5489.28,NaN,Bereich-3,prd-60,9-43649-1,C-117
53,54,2/23/2025,2025,Mexiko,Oaxaca,4633.35,3706.68,NaN,Bereich-3,prd-61,9-43650-1,C-117

#### Welche Städte gibt es?

In [10]:
mexiko.Stadt.unique()

array(['Oaxaca', 'Puebla', 'Veracruz', 'Monterrey', 'Ciudad Juárez',
       'Cancún', 'Guanajuato', 'San Luis Potosi', 'Durango', 'Acapulco',
       'Torreón'], dtype=object)

### Mexiko Datengrundlage

In [11]:
mexiko = umsatz[umsatz.iloc[:, 3] == "Mexiko"]

### Gruppierung nach Städten

In [13]:
mexiko.groupby(by="Stadt").agg({"Umsatz":"mean"}).transpose()

Stadt,Acapulco,Cancún,Ciudad Juárez,Durango,Guanajuato,Monterrey,Oaxaca,Puebla,San Luis Potosi,Torreón,Veracruz
Umsatz,6147.4,6271.377273,6302.768182,6075.43,6378.9,6511.3625,5800.1,6369.075,6734.740909,5607.9,5949.123529

### Gruppieren nach mehreren Kategorien

#### Wie sieht der Median der Kosten aus des Vereinigten Königreichs nach Bereich und Stadt?

In [16]:
uk = umsatz[umsatz.Land == "Vereinigtes Königreich"]

In [17]:
uk.head(1)

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
2,3,1/3/2025,2025,Vereinigtes Königreich,London,5437.65,6198.92,NaN,Bereich-1,prd-56,7-43647-1,C-141

In [19]:
uk.groupby(by=["Bereich", "Stadt"]).agg({"Kosten":"median"}).transpose()

Bereich  Bereich-1
Stadt   Birmingham  Bristol    Leeds Leicester Liverpool  London Manchester
Kosten      5605.5  5022.84  4183.44   6055.86   6918.84  5506.8    5279.52  \

Bereich  Bereich-2                     ... Bereich-4
Stadt   Birmingham  Bristol Liverpool  ... Liverpool  London Manchester
Kosten      6263.4  5116.98   6735.36  ...   5578.98  3971.4    5178.24  \

Bereich  Bereich-5
Stadt   Birmingham  Bristol    Leeds Leicester Liverpool   London Manchester
Kosten     6385.32  4957.98  5702.04   4961.64   5750.64  6738.12    5596.32

[1 rows x 33 columns]

### Gruppieren nach mehreren numerischen Werten

#### Wie viele unterschiedliche Ausprägungen von Logistik-Code und Kunde gibt es?

In [22]:
print(len(umsatz["Logistik-Code"].unique()))
print(len(umsatz["Kunde"].unique()))

598
11

### Gruppierung nach Kunde für Umsatz (Standardabweichung) und Kosten (Maximum)

In [23]:
umsatz.groupby(by=["Kunde"]).agg({"Umsatz":"std", "Kosten":"max"})

            Umsatz    Kosten
Kunde
C-107  1218.526107   7512.37
C-109  1475.300186   8634.48
C-115  1381.297646   9774.19
C-117  1252.225275   7778.76
C-124  1075.688967   9789.41
C-137   976.451095   5738.16
C-141  1134.676711   7073.41
C-53   1020.875504   7708.64
C-65   1680.315843  12141.68
C-76   1472.607996  10760.52
C-85   1179.747904   7019.93